let age = prompt('Твій рік народження?');
if (age != null) {
    alert(`Твій вік ${2023- age}`)
}else {
    alert('Шкода, що ти не захотіл ввести свій рік народження')
}
let city = prompt('В якому місті ти живеш?');
if(city != null) {
    switch (city) {
        case 'Київ':
            alert( 'Ти живеш у столиці України');
            break;
        case 'Лондон':
            alert( 'Ти живеш у столиці Англії');
            break;
        case 'Вашингтон':
            alert( 'Ти живеш у столиці Америки');
            break;
        default:
            alert(`Ти живеш у місті ${city}`);
    }
}else {
    alert('Шкода, що ти не захотів ввести своє місто')
}
let sport = prompt('Твій улюблений вид спорту?');
if(sport != null){
    switch (sport){
        case 'шахи':
            alert('Круто! Хочеш стати як Андрей Волокитин?');
            break;
        case  'плавание ':
            alert('Круто! Хочеш стати як Яна Клочкова?');
            break;
        case 'гімнастика':
            alert('Круто! Хочеш стати як Лилия Подкопаєва?');
            break;
        default:
            alert(`Твій улюблений вид спорту ${sport}`);
    }
}else {
    alert('Шкода, що ти не захотів ввести свій улюблений вид спорту!');
}